Revit 2026 API

# IConnectorHeight Property

---

The height of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
double Height { get; }
```
```vb
ReadOnly Property Height As Double
	Get
```
```cpp
property double Height {
	double get ();
}
```
```fsharp
abstract Height : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the connector's shape is not rectangular. |

This property is used to retrieve the height of the connector.

#### Reference

IConnector Interface

Autodesk.Revit.DB Namespace